In [1]:
import pandas as pd

In [5]:
## structure data 
# dataframe  

dt = {"Name":["aman","gagan","naman","chaman"],
     "branch":['it','it','cse','ece'], 
     "class":[2,1,3,4], 
     "city":['jaipur','aligarh','vridavan','mathura']}  
dt

{'Name': ['aman', 'gagan', 'naman', 'chaman'],
 'branch': ['it', 'it', 'cse', 'ece'],
 'class': [2, 1, 3, 4],
 'city': ['jaipur', 'aligarh', 'vridavan', 'mathura']}

In [8]:
# type(dt )  

df = pd.DataFrame(dt) 
df

     Name branch  class      city
0    aman     it      2    jaipur
1   gagan     it      1   aligarh
2   naman    cse      3  vridavan
3  chaman    ece      4   mathura

In [9]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
df['Name']   ## signle columns type ===> series

0      aman
1     gagan
2     naman
3    chaman
Name: Name, dtype: object

In [12]:
type(df['Name'] )

pandas.core.series.Series

In [19]:
df[['branch','Name']]  #

  branch    Name
0     it    aman
1     it   gagan
2    cse   naman
3    ece  chaman

In [16]:
d

     Name branch  class      city
0    aman     it      2    jaipur
1   gagan     it      1   aligarh
2   naman    cse      3  vridavan
3  chaman    ece      4   mathura

In [2]:
import pandas as pd

In [5]:
file_path = r"C:\Users\Ranjit\Desktop\jecrc-10-may2024\Used_Bikes.csv" 
df = pd.read_csv(file_path)
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [7]:
df = pd.read_csv('Used_Bikes.csv') 
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [8]:
df.head() # top 5 rows

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [9]:
df.tail()   # bottom 5 row

,bike_name,price,city,kms_driven,owner,age,power,brand
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [10]:
df.head(10)

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

In [13]:
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [15]:
df.city     #df['city']   ## dataframe 0r series

0        Ahmedabad
1            Delhi
2            Delhi
3        Bangalore
4        Bangalore
           ...
32643        Delhi
32644       Karnal
32645        Delhi
32646       Jaipur
32647         Pune
Name: city, Length: 32648, dtype: object

In [17]:
df[['city','price']]

            city     price
0      Ahmedabad   35000.0
1          Delhi  119900.0
2          Delhi  600000.0
3      Bangalore   65000.0
4      Bangalore   80000.0
...          ...       ...
32643      Delhi   39000.0
32644     Karnal   30000.0
32645      Delhi   60000.0
32646     Jaipur   15600.0
32647       Pune   22000.0

[32648 rows x 2 columns]

In [19]:
df[0:2]   ## 0 , 1

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield

In [21]:
df[2:4]

,bike_name,price,city,kms_driven,owner,age,power,brand
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS

In [24]:
df2 = df[2:4]
df2

,bike_name,price,city,kms_driven,owner,age,power,brand
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS

In [26]:
df2[['bike_name',	'price',	"city",	"kms_driven",	"owner"]]

              bike_name     price       city  kms_driven        owner
2  Triumph Daytona 675R  600000.0      Delhi       110.0  First Owner
3  TVS Apache RTR 180cc   65000.0  Bangalore     16329.0  First Owner

In [29]:
df2 = df[1:5]

In [32]:
df2[["kms_driven",	"owner",	"age",	"power",	"brand"]]

   kms_driven        owner  age  power          brand
1     11000.0  First Owner  4.0  350.0  Royal Enfield
2       110.0  First Owner  8.0  675.0        Triumph
3     16329.0  First Owner  4.0  180.0            TVS
4     10000.0  First Owner  3.0  150.0         Yamaha

In [35]:
## loc & iloc  
df.loc[2:5,['kms_driven','owner','age','power','brand']]   # [row,column]

   kms_driven        owner  age  power    brand
2       110.0  First Owner  8.0  675.0  Triumph
3     16329.0  First Owner  4.0  180.0      TVS
4     10000.0  First Owner  3.0  150.0   Yamaha
5     25000.0  First Owner  6.0  150.0   Yamaha

In [38]:
# df.head(20) 
df.iloc[2:4,3:7]   # [row,column]

   kms_driven        owner  age  power
2       110.0  First Owner  8.0  675.0
3     16329.0  First Owner  4.0  180.0

In [39]:
df.iloc[5:8]  ##

,bike_name,price,city,kms_driven,owner,age,power,brand
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero

In [45]:
jaipur = df[df['city'] == "Jaipur"]

In [47]:
jaipur.shape

(1007, 8)

In [50]:
jaipur['brand'].nunique()

13

In [51]:
jaipur['brand'].unique()

array(['Mahindra', 'Suzuki', 'Royal Enfield', 'Harley-Davidson', 'Honda',
       'Hero', 'Bajaj', 'KTM', 'Yamaha', 'TVS', 'Benelli', 'Kawasaki',
       'Hyosung'], dtype=object)

In [52]:
jaipur['brand'].value_counts()

brand
Hero               731
Bajaj               83
Honda               53
TVS                 42
Yamaha              37
Royal Enfield       29
Harley-Davidson      8
KTM                  8
Mahindra             6
Suzuki               5
Benelli              3
Kawasaki             1
Hyosung              1
Name: count, dtype: int64

In [55]:
sample = df[(df['city']=="Jaipur")&(df['brand']=="KTM")&(df['owner']=="First Owner")]

In [58]:
sample

,bike_name,price,city,kms_driven,owner,age,power,brand
888,KTM RC 390cc,147000.0,Jaipur,15000.0,First Owner,6.0,390.0,KTM
4945,KTM Duke 390cc,200000.0,Jaipur,11700.0,First Owner,4.0,390.0,KTM
4948,KTM RC 390cc,175000.0,Jaipur,10880.0,First Owner,4.0,390.0,KTM
6073,KTM RC 200cc,190000.0,Jaipur,7902.0,First Owner,2.0,200.0,KTM
6159,KTM Duke 250cc,135000.0,Jaipur,12507.0,First Owner,4.0,250.0,KTM
6552,KTM RC 200cc,190000.0,Jaipur,7902.0,First Owner,2.0,200.0,KTM
6734,KTM RC 200cc,128000.0,Jaipur,15000.0,First Owner,4.0,200.0,KTM
7561,KTM Duke 250cc,150000.0,Jaipur,12500.0,First Owner,4.0,250.0,KTM

In [59]:
sample.to_csv("jaipur_ktm.csv",index=False,)

In [60]:
sample.to_dict()

{'bike_name': {888: 'KTM RC 390cc',
  4945: 'KTM Duke 390cc',
  4948: 'KTM RC 390cc',
  6073: 'KTM RC 200cc',
  6159: 'KTM Duke 250cc',
  6552: 'KTM RC 200cc',
  6734: 'KTM RC 200cc',
  7561: 'KTM Duke 250cc'},
 'price': {888: 147000.0,
  4945: 200000.0,
  4948: 175000.0,
  6073: 190000.0,
  6159: 135000.0,
  6552: 190000.0,
  6734: 128000.0,
  7561: 150000.0},
 'city': {888: 'Jaipur',
  4945: 'Jaipur',
  4948: 'Jaipur',
  6073: 'Jaipur',
  6159: 'Jaipur',
  6552: 'Jaipur',
  6734: 'Jaipur',
  7561: 'Jaipur'},
 'kms_driven': {888: 15000.0,
  4945: 11700.0,
  4948: 10880.0,
  6073: 7902.0,
  6159: 12507.0,
  6552: 7902.0,
  6734: 15000.0,
  7561: 12500.0},
 'owner': {888: 'First Owner',
  4945: 'First Owner',
  4948: 'First Owner',
  6073: 'First Owner',
  6159: 'First Owner',
  6552: 'First Owner',
  6734: 'First Owner',
  7561: 'First Owner'},
 'age': {888: 6.0,
  4945: 4.0,
  4948: 4.0,
  6073: 2.0,
  6159: 4.0,
  6552: 2.0,
  6734: 4.0,
  7561: 4.0},
 'power': {888: 390.0,
  4945: 390.0,
  4948: 390.0,
  6073: 200.0,
  6159: 250.0,
  6552: 200.0,
  6734: 200.0,
  7561: 250.0},
 'brand': {888: 'KTM',
  4945: 'KTM',
  4948: 'KTM',
  6073: 'KTM',
  6159: 'KTM',
  6552: 'KTM',
  6734: 'KTM',
  7561: 'KTM'}}